# VLAN com DHCP  
Passo a passo para configurar este projeto.  
![img](image.png)

**Objetivo:** Criar uma rede com mÃºltiplas VLANs, utilizando `modo trunk` entre switches e um servidor DHCP para fornecer IPs automaticamente Ã s VLANs.

## âš™ï¸ ConfiguraÃ§Ãµes bÃ¡sicas (switches e roteador)

â¡ï¸ Siga os mesmos passos de configuraÃ§Ã£o inicial do [ex1](../ex1-DHCP-DNS/passo-a-passo.md/): hostname, banner, senha, salvar e reiniciar.

## ğŸ§© Criando as VLANs

â¡ï¸ Primeiro, crie as VLANs normalmente (como no [ex2](../ex2-VLAN/passo-a-passo.md/)):
```bash
Switch(config)#vlan 2
Switch(config-vlan)#name TI
Switch(config-vlan)#exit

Switch(config)#vlan 3
Switch(config-vlan)#name VENDAS
Switch(config-vlan)#exit
```

## ğŸ” Habilitando o modo trunk

```bash
Switch(config)#interface gigabitethernet0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan all
Switch(config-if)#do write memory
```
â¡ï¸ Isso permite que o switch envie trÃ¡fego de **mÃºltiplas VLANs** por uma Ãºnica porta.

## ğŸ”Œ Atribuindo portas Ã s VLANs

â¡ï¸ Siga os mesmos passos do [ex2](../ex2-VLAN/passo-a-passo.md/), por exemplo:

```bash
Switch(config)#interface range fastethernet0/2-5
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit

Switch(config)#interface range fastethernet0/6-9
Switch(config-if-range)#switchport access vlan 3
Switch(config-if-range)#exit
```

## ğŸ“¡ No Roteador (Subinterfaces para VLANs)

```bash
Router>enable
Router#configure terminal

Router(config)#interface gigabitethernet0/0/0
Router(config-if)#no ip address
Router(config-if)#no shutdown
Router(config-if)#exit

Router(config)#interface gigabitethernet0/0/0.1
Router(config-subif)#encapsulation dot1Q 1
Router(config-subif)#ip address 192.168.1.1 255.255.255.0
Router(config-subif)#ip helper-address 192.168.1.2
Router(config-subif)#exit

Router(config)#interface gigabitethernet0/0/0.2
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip address 192.168.5.1 255.255.255.0
Router(config-subif)#ip helper-address 192.168.1.2
Router(config-subif)#exit

Router(config)#interface gigabitethernet0/0/0.3
Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip address 192.168.10.1 255.255.255.0
Router(config-subif)#ip helper-address 192.168.1.2
Router(config-subif)#exit

Router#write memory
```

â¡ï¸ Cada subinterface representa uma VLAN.
â¡ï¸ O comando `ip helper-address` direciona as requisiÃ§Ãµes de DHCP para o **servidor DHCP centralizado** (neste caso, 192.168.1.2).

---

## ğŸ–¥ï¸ No Servidor (DHCP + DNS)

Configure o IP do servidor:

```txt
IP:       192.168.1.2  
GATEWAY:  192.168.1.1  
DNS:      192.168.1.2
```

### VÃ¡ para `Services` â†’ `DHCP` e crie 3 pools:

#### ğŸŸ¢ Pool 1 (Rede do servidor - VLAN 1)

* Gateway: 192.168.1.1
* DNS: 192.168.1.2
* Save

#### ğŸ”µ Pool 2 (VLAN 2 - TI)

* Pool name: Vlan2
* Gateway: 192.168.5.1
* DNS: 192.168.1.2
* Add

#### ğŸŸ  Pool 3 (VLAN 3 - Vendas)

* Pool name: Vlan3
* Gateway: 192.168.10.1
* DNS: 192.168.1.2
* Add

## ğŸ§‘â€ğŸ’» Nos Computadores
VÃ¡ para `Desktop` â†’ `IP Configuration ` e escolha **DHCP**.
â¡ï¸ Se os IPs forem atribuÃ­dos automaticamente e estiverem na faixa correta da VLAN, estÃ¡ tudo funcionando!

## âœ… Testes

1. Com **PDU (Ã­cone de envelope)**, teste a comunicaÃ§Ã£o entre dois PCs de **VLANs diferentes**.
   Resultado esperado: `âœ”ï¸ Sucesso`.
2. Teste tambÃ©m acesso ao DNS (se configurado), por exemplo acessando um domÃ­nio via navegador.