# VoIP
Passo a passo para configurar este projeto.  
![img](image.png)

* Requisitos: utilizar um roteador Cisco **2811**.

**Objetivo:** Criar uma rede com telefonia IP (VoIP), onde os telefones IP recebem IP via DHCP e n√∫meros de ramais manuais.

## üõ†Ô∏è 1. Configura√ß√µes b√°sicas em switches e roteador

‚û°Ô∏è Siga os mesmos passos de configura√ß√£o inicial do [ex1](../ex1-DHCP-DNS/passo-a-passo.md/): hostname, banner, senha, salvar e reiniciar.

## üîß 2. Criar a VLAN de Voz

```bash
Switch>enable
Switch#configure terminal
Switch(config)#interface range fastethernet 0/1-3
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport voice vlan 1
Switch(config-if-range)#end
Switch#write
```
‚û°Ô∏è Atribui a VLAN de voz √†s portas onde est√£o conectados os telefones IP.

## üåê 3. Configura√ß√£o de IP no roteador (FastEthernet 0/0)

```bash
Router>enable
Router#configure terminal
Router(config)#no ip domain lookup
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#end
```
‚û°Ô∏è Configura o IP da interface conectada ao switch, para funcionar como gateway.

## üì¶ 4. Configura√ß√£o do DHCP (com op√ß√£o para telefones IP)

```bash
Router>enable
Router#configure terminal
Router(config)#ip dhcp pool voip
Router(dhcp-config)#network 192.168.0.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.0.1
Router(dhcp-config)#option 150 ip 192.168.0.1
Router(dhcp-config)#exit
Router(config)#ip dhcp excluded-address 192.168.0.1
Router(config)#do write memory
```
‚û°Ô∏è Distribui IPs para os telefones IP e indica onde est√° o servidor TFTP via `option 150` (neste caso, o pr√≥prio roteador).

## üìû 5. Configura√ß√£o do servi√ßo de telefonia (CME)

```bash
Router> enable
Router# configure terminal
Router(config)# telephony-service
Router(config-telephony)# max-dn 3
Router(config-telephony)# max-ephones 3
Router(config-telephony)# ip source-address 192.168.0.1 port 2000
Router(config-telephony)# auto assign 1 to 3
Router(config-telephony)# exit
```
‚û°Ô∏è Habilita o servi√ßo CME, define quantos ramais e telefones s√£o permitidos e configura o IP para comunica√ß√£o. A porta 2000 √© padr√£o para o protocolo SCCP, que o Cisco usa pra sinaliza√ß√£o de chamadas.

## üî¢ 6. Definindo os ramais manualmente

```bash
Router(config)# ephone-dn 1
Router(config-ephone-dn)# number 1001
Router(config-ephone-dn)# exit

Router(config)# ephone-dn 2
Router(config-ephone-dn)# number 1002
Router(config-ephone-dn)# exit

# ... repita para cada telefone
Router# write memory
```
‚û°Ô∏è Cada `ephone-dn` representa um ramal. Aqui, estamos criando os n√∫meros para os telefones IP.

## üß™ 7. Testes e finaliza√ß√µes

* Conecte os **telefones IP**, ligue a energia.
* Nos **computadores**, v√° em `Desktop` ‚Üí `IP Configuration` e clique em **DHCP**.
* Verifique se os telefones recebem IP e n√∫mero automaticamente.
* Realize chamadas entre os ramais.
* Use o **PDU** para testar comunica√ß√£o geral da rede.