# Duas redes, um servidor DNS e uma pÃ¡gina HTML  
Passo a passo para configurar este projeto.  
![img](image.png)

**Objetivo:** Fazer as duas redes se comunicarem. Uma com servidor DHCP/DNS, a outra configurada manualmente.

## âš™ï¸ ConfiguraÃ§Ãµes bÃ¡sicas nos switches (e roteador)

### ðŸ”  Definindo um Hostname

```bash
Switch>enable
Switch#configure terminal
Switch(config)#hostname s1  # ou s2, sterrio, s1piso, r1, etc.
```
âž¡ï¸ Isso muda o nome do dispositivo, pra facilitar a identificaÃ§Ã£o na topologia.

### ðŸ§¾ Colocando um Banner

```bash
Switch(config)#banner motd # ACESSO RESTRITO #
```
âž¡ï¸ O banner aparece na hora que alguÃ©m acessa o dispositivo pelo terminal. Ideal pra avisos.

### ðŸ”’ Colocando uma Senha

```bash
Switch(config)#line console 0
Switch(config-line)#password 1234  # (pode ser uma senha mais forte)
Switch(config-line)#login
Switch(config-line)#exit
```
âž¡ï¸ Isso protege o acesso via console com senha. 

### ðŸ’¾ Salvando as configuraÃ§Ãµes

```bash
Switch(config)#do copy running-config startup-config
```
âž¡ï¸ Salva a configuraÃ§Ã£o atual para que ela nÃ£o se perca se o dispositivo reiniciar.

### ðŸ” Reiniciando

```bash
Switch(config)#do reload
```
âž¡ï¸ Reinicia o dispositivo. 

## ðŸŒ Configurando os IPs

### No roteador (interfaces para as redes)

```bash
Router>enable
Router#configure terminal

Router(config)#interface gigabitethernet0/0/0
Router(config-if)#ip address 192.168.5.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit

Router(config)#interface gigabitethernet0/0/1
Router(config-if)#ip address 192.168.10.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
```
âž¡ï¸ Define IPs nas interfaces do roteador que vÃ£o se conectar Ã s duas redes. SÃ£o os gateways.

## ðŸ–¥ï¸ No servidor

### `Desktop` â†’ `IP Configuration`

* Configure manualmente um IP na mesma rede do switch (ex: `192.168.5.2`)
* Gateway: IP do roteador (ex: `192.168.5.1`)
* DNS: o **prÃ³prio IP do servidor**

### `Services` â†’ `DHCP`

* `Service: ON`
* `Gateway` e `DNS Server`: os mesmos definidos acima
* `Start IP Address`: por exemplo, `192.168.5.3`
* Clique em `Save`
âž¡ï¸ Isso permite ao servidor distribuir IPs automaticamente para os PCs da rede.

### `Services` â†’ `DNS`

* `DNS Service: ON`
* `Name`: por exemplo, `www.meuservidor.com`
* `Address`: IP do prÃ³prio servidor (ex: `192.168.5.2`)
* Clique em `Add`
âž¡ï¸ Agora vocÃª pode acessar o servidor pelo nome e nÃ£o sÃ³ pelo IP.

### (Opcional) `Services` â†’ `HTTP`

* Configure uma pÃ¡gina HTML simples para que os PCs possam acessÃ¡-la via navegador.

## ðŸ’» Configurando os PCs

### Manualmente (para a rede sem DHCP: `192.168.10.0`)

* `Desktop` â†’ `IP Configuration`
* IP: ex: `192.168.10.2` -> mudar os IPs para cada computador
* Subnet: `255.255.255.0`
* Gateway: `192.168.10.1`
* DNS: `192.168.5.2` (IP do servidor da outra rede)

### Via DHCP (para a rede `192.168.5.0`)

* `Desktop` â†’ `IP Configuration`
* Selecione `DHCP`
* Deve aparecer IP automÃ¡tico. Se funcionar, tÃ¡ tudo certo!

## âœ… Testes

1. Use o **PDU** (Ã­cone de envelope) para testar conectividade entre PCs e servidores.
2. Nos PCs, vÃ¡ em `Desktop` â†’ `Web Browser` â†’ digite o domÃ­nio que vocÃª configurou (ex: `www.meuservidor.com`) â€” se abrir, sucesso!