# Procolo RIP
Passo a passo para configurar este projeto.
![img](image.png)

**Requisitos:** utilizar roteadores com interfaces seriais (ex: `NIM-2T`) e **cabo serial DCE/DTE** para interlig√°-los.

**Objetivo:** Estabelecer comunica√ß√£o entre PCs de redes diferentes usando o protocolo de roteamento din√¢mico **RIP** e conex√µes seriais entre roteadores.

## üõ†Ô∏è 1. Adicionar interfaces seriais aos roteadores

‚û°Ô∏è Clique no roteador ‚Üí `Physical` ‚Üí **Desligue o roteador** ‚Üí arraste o m√≥dulo **NIM-2T ou HWIC-2T** para um slot vazio ‚Üí **Ligue novamente**.

## üîå 2. Conectar os roteadores com cabos seriais

‚û°Ô∏è Use o **cabo serial (DCE)** entre as interfaces seriais (ex: `serial0/0/0`, `serial0/0/1`, etc).

## üîß 3. Configurar IPs e interfaces em cada roteador

### Exemplo: Roteador 0

```bash
Router0>enable
Router0#configure terminal

# Rede interna
Router0(config)#interface gig0/0/0
Router0(config-if)#ip address 10.0.0.1 255.255.255.0
Router0(config-if)#no shutdown

# Serial para Router1
Router0(config)#interface serial0/1/1
Router0(config-if)#ip address 192.168.1.1 255.255.255.0
Router0(config-if)#no shutdown

# Serial para Router2
Router0(config)#interface serial0/1/0
Router0(config-if)#ip address 192.168.2.1 255.255.255.0
Router0(config-if)#no shutdown

Router0(config)#exit
Router0(config)#do write memory
```
‚û°Ô∏è Repita o mesmo nos outros roteadores, ajustando os IPs conforme sua topologia.

## üì° 4. Configurar RIP

Em todos os roteadores:

```bash
Router(config)#router rip
Router(config-router)#network 10.0.0.0      # rede local
Router(config-router)#network 192.168.1.0   # link serial com R1
Router(config-router)#network 192.168.2.0   # link serial com R2
Router(config-router)#exit
Router#write memory
```
‚û°Ô∏è Adapte os network conforme as redes de cada roteador.
‚û°Ô∏è Todas as interfaces com IP precisam ser inclu√≠das para que o RIP funcione corretamente.

Para funcionar mesmo se um cabo for desconectado:
‚û°Ô∏è Inclua todas as redes conectadas no RIP. Assim, o protocolo pode recalcular rotas automaticamente e manter a comunica√ß√£o entre as m√°quinas. Ou seja, em cada roteador, ser√£o seis redes adicionadas no rip.

## üíª 5. Configurar IP nos PCs

‚û°Ô∏è V√° em cada PC ‚Üí `Desktop` ‚Üí `IP Configuration`
‚û°Ô∏è Adicione o IP da rede local e configure o **gateway** com o IP do roteador correspondente.

## üß™ 6. Testes

* Use o **PDU simples (√≠cone de carta)** para testar comunica√ß√£o entre PCs de redes diferentes.
* Todos devem conseguir se comunicar se o RIP estiver propagando corretamente.